; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v7 - type_1 ?v1 - type_2)
 	      (pred_4 ?v3 - object ?v1 - type_2)
	      (pred_2 ?v7 - type_1 ?v5 - type_3)
	      (pred_1 ?v7 - type_1 ?v3 - object ?v5 - type_3))

   (:action op_3
       :parameters  (?v7 - type_1 ?v4 ?v2 - type_2)
       :precondition (and  (pred_3 ?v7 ?v4))
       :effect (and  (pred_3 ?v7 ?v2)
		     (not (pred_3 ?v7 ?v4))))

   (:action op_2
       :parameters (?v7 - type_1 ?v8 - object ?v6 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v6) (pred_3 ?v7 ?v6) (pred_2 ?v7 ?v5))
       :effect (and (pred_1 ?v7 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v6)) 
		    (not (pred_2 ?v7 ?v5))))

   (:action op_1
       :parameters (?v7 - type_1 ?v8 - object ?v6 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v8 ?v5) (pred_3 ?v7 ?v6))
       :effect (and (pred_4 ?v8 ?v6)
		    (pred_2 ?v7 ?v5)
		    (not (pred_1 ?v7 ?v8 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_03 - type_1
obj_07 obj_02 - type_3
obj_08 obj_01 obj_06 - type_2
obj_05 obj_04 obj_09 - object)
(:init
(pred_3 obj_03 obj_01)
(pred_2 obj_03 obj_07)
(pred_2 obj_03 obj_02)
(pred_4 obj_05 obj_06)
(pred_4 obj_04 obj_08)
(pred_4 obj_09 obj_01)
)
(:goal
(and
(pred_4 obj_05 obj_06)
(pred_4 obj_04 obj_01)
(pred_4 obj_09 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_03 ?b obj_02))))
)
)

; plan
1. (op_2 obj_03 obj_09 obj_01 obj_07)
   deleted: (pred_4 obj_09 obj_01) (pred_2 obj_03 obj_07)
   added: (pred_1 obj_03 obj_09 obj_07)
   goals met: 1 of 3
2. (op_3 obj_03 obj_01 obj_06)
   deleted: (pred_3 obj_03 obj_01)
   added: (pred_3 obj_03 obj_06)
   goals met: 1 of 3
3. (op_1 obj_03 obj_09 obj_06 obj_07)
   deleted: (pred_1 obj_03 obj_09 obj_07)
   added: (pred_4 obj_09 obj_06) (pred_2 obj_03 obj_07)
   goals met: 2 of 3
4. (op_3 obj_03 obj_06 obj_08)
   deleted: (pred_3 obj_03 obj_06)
   added: (pred_3 obj_03 obj_08)
   goals met: 2 of 3
5. (op_2 obj_03 obj_04 obj_08 obj_07)
   deleted: (pred_4 obj_04 obj_08) (pred_2 obj_03 obj_07)
   added: (pred_1 obj_03 obj_04 obj_07)
   goals met: 2 of 3
6. (op_3 obj_03 obj_08 obj_01)
   deleted: (pred_3 obj_03 obj_08)
   added: (pred_3 obj_03 obj_01)
   goals met: 2 of 3
7. (op_1 obj_03 obj_04 obj_01 obj_07)
   deleted: (pred_1 obj_03 obj_04 obj_07)
   added: (pred_4 obj_04 obj_01) (pred_2 obj_03 obj_07)
   goals met: 3 of 3
